# Brewfile

tap "deskflow/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kismetwireless/kismet"
tap "msoap/tools"
tap "oven-sh/bun"
tap "sst/tap"
tap "wpscanteam/tap"

# Productivity & Utilities
brew "brightness"                         # Change macOS display brightness from the command-line
brew "fend"                               # Arbitrary-precision unit-aware calculator
brew "figlet"                             # Banner-like program prints strings as ASCII art
brew "fswatch"                            # Monitor a directory for changes and run a shell command
brew "keyring"                            # Easy way to access the system keyring service from python
brew "msoap/tools/shell2http"             # Executing shell commands via simple http server
brew "qrencode"                           # QR Code generation
brew "restic"                             # Fast, efficient and secure backup program
brew "stress"                             # Tool to impose load on and stress test a computer system
brew "tldr"                               # Simplified and community-driven man pages
brew "tty-clock"                          # Digital clock in ncurses
brew "viddy"                              # Modern watch command
brew "watch"                              # Executes a program periodically, showing output fullscreen
cask "anki"                               # Memory training application
cask "bartender"                          # Menu bar icon organiser
cask "contexts"                           # Allows switching between application windows
cask "hazeover"                           # Windows manager and desktop organiser
cask "karabiner-elements"                 # Keyboard customiser
cask "mark-text"                          # Markdown editor
cask "mqtt-explorer"
cask "paletro"                            # Command palette in any application
cask "quicklook-json"                     # Quick Look plugin for JSON files
cask "raycast"                            # Control your tools with a few keystrokes
cask "rectangle"                          # Move and resize windows using keyboard shortcuts or snap areas
cask "swiftbar"                           # Menu bar customization tool
cask "topnotch"                           # Utility to hide the notch
cask "vienna"                             # RSS and Atom reader

# Browsers & Communication
cask "chatgpt"                            # OpenAI's official ChatGPT desktop app
cask "discord"                            # Voice and text chat software
cask "firefox"                            # Web browser
cask "microsoft-teams"                    # Meet, chat, call, and collaborate in just one place
cask "signal"                             # Instant messaging application focusing on security
cask "ungoogled-chromium"                 # Chromium browser without Google integration

# Version Control & Git Tools
brew "gh"                                 # GitHub command-line tool
brew "git-delta"                          # Syntax-highlighting pager for git and diff output
brew "git"                                # Distributed revision control system
brew "lazygit"                            # Simple terminal UI for git commands
brew "tig"                                # Text interface for Git repositories

# Cloud & DevOps Tools
brew "ansible"                            # Automate deployment, configuration, and upgrading
brew "awscli"                             # Official Amazon AWS command-line interface
brew "dive"                               # Tool for exploring each layer in a docker image
brew "fluxcd/tap/flux"                    # Flux CLI
brew "helm"                               # Kubernetes package manager
brew "helmfile"                           # Deploy Kubernetes Helm Charts
brew "k9s"                                # Kubernetes CLI To Manage Your Clusters In Style!
brew "krew"                               # Package manager for kubectl plugins
brew "kubeconform"                        # FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubernetes-cli"                     # Kubernetes command-line interface
brew "linode-cli"                         # CLI for the Linode API
cask "orbstack"                           # Replacement for Docker Desktop

# Database & Storage Tools
brew "beanstalkd"                         # Generic work queue originally designed to reduce web latency
brew "mysql-client"                       # Open source relational database management system
brew "rainfrog"                           # Database management TUI for PostgreSQL/MySQL/SQLite
cask "db-browser-for-sqlite"              # Browser for SQLite databases

# Development Tools & Programming Languages
brew "ccls"                               # C/C++/ObjC language server
brew "clang-format"                       # Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "cmake"                              # Cross-platform make
brew "composer"                           # Dependency Manager for PHP
brew "doxygen"                            # Generate documentation for several programming languages
brew "gcc"                                # GNU compiler collection
brew "go"                                 # Open source programming language to build simple/reliable/efficient software
brew "n"                                  # Node version management
brew "neovim"                             # Ambitious Vim-fork focused on extensibility and agility
brew "oven-sh/bun/bun"                    # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "php"                                # General-purpose scripting language
brew "pnpm"                               # Fast, disk space efficient package manager
brew "pyenv"                              # Python version management
brew "rustup"                             # Rust toolchain installer
brew "shellcheck"                         # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"                              # Autoformat shell script source code
brew "sst/tap/opencode"                   # The AI coding agent built for the terminal.
brew "vim"                                # Vi 'workalike' with many additional features
brew "yarn"                               # JavaScript package manager
cask "vscodium"                           # Binary releases of VS Code without MS branding/telemetry/licensing

# File Management & Cloud Storage
brew "b2-tools"                           # B2 Cloud Storage Command-Line Tools
brew "rsync"                              # Utility that provides fast incremental file transfer
cask "appcleaner"                         # Application uninstaller
cask "betterzip"                          # Utility to create and modify archives
cask "nextcloud"                          # Desktop sync client for Nextcloud software products
cask "synology-drive"                     # Sync and backup service to Synology NAS drives

# Hardware & Device Management
brew "nut"                                # Network UPS Tools: Support for various power devices
brew "smartmontools"                      # SMART hard drive monitoring
cask "altserver"                          # iOS App Store alternative
cask "raspberry-pi-imager"                # Imaging utility to install operating systems to a microSD card

# Multimedia & File Processing
brew "atomicparsley"                      # MPEG-4 command-line tool
brew "exiftool"                           # Perl lib for reading and writing EXIF metadata
brew "ffmpeg"                             # Play, record, convert, and stream audio and video
brew "ghostscript"                        # Interpreter for PostScript and PDF
brew "id3v2"                              # Command-line editor
brew "imagemagick"                        # Tools and libraries to manipulate images in many formats
brew "pngcrush"                           # Optimizer for PNG files
brew "poppler"                            # PDF rendering library (based on the xpdf-3.0 code base)
brew "tesseract"                          # OCR (Optical Character Recognition) engine
brew "vips"                               # Image processing library
brew "yt-dlp"                             # Feature-rich command-line audio/video downloader
cask "iina"                               # Free and open-source media player
cask "netdownloadhelpercoapp"             # Allows video downloads from the Web
cask "qbittorrent"                        # Peer to peer Bitorrent client

# Networking & Security Tools
brew "bettercap"                          # Swiss army knife for network attacks and monitoring
brew "certigo"                            # Utility to examine and validate certificates in a variety of formats
brew "dhcpdump"                           # Monitor DHCP traffic for debugging purposes
brew "dnsmasq"                            # Lightweight DNS forwarder and DHCP server
brew "doggo"                              # Command-line DNS Client for Humans
brew "iperf3"                             # Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "kismetwireless/kismet/kismet-git"   # Kismet Wi-Fi and Wireless Sniffer
brew "mtr"                                # 'traceroute' and 'ping' in a single tool
brew "nmap"                               # Port scanning utility for large networks
brew "openfortivpn"                       # Open Fortinet client for PPP+TLS VPN tunnel services
brew "speedtest-cli"                      # Command-line interface for https://speedtest.net bandwidth tests
brew "ssh-audit"                          # SSH server & client auditing
brew "step"                               # Crypto and x509 Swiss-Army-Knife
brew "tcping"                             # TCP connect to the given IP/port combo
brew "telnet"                             # User interface to the TELNET protocol
brew "wpscanteam/tap/wpscan"              # Black box WordPress vulnerability scanner
cask "mitmproxy"                          # Intercept, modify, replay, save HTTP/S traffic
cask "mullvad-vpn"                        # Privacy-focused VPN service
cask "wireshark-app"                      # Network protocol analyzer

# Remote Access & Control
cask "deskflow"                           # Mouse and Keyboard sharing utility
cask "rustdesk"                           # Open source virtual/remote desktop application
cask "vnc-viewer"                         # Remote desktop application focusing on security

# Security & Password Management
brew "bitwarden-cli"                      # Secure and free password manager for all of your devices
brew "gnupg"                              # GNU Pretty Good Privacy (PGP) package
brew "gnutls"                             # GNU Transport Layer Security (TLS) Library
brew "gpgme"                              # Library access to GnuPG
brew "pinentry-mac"                       # Pinentry for GPG on Mac
cask "bitwarden"                          # Desktop password and login vault
cask "blockblock"                         # Monitors common persistence locations
cask "imhex"                              # Hex editor for reverse engineers
cask "keepassxc"                          # Password manager app
cask "knockknock"                         # Tool to show what is persistently installed on the computer

# System Utilities & CLI Tools
brew "autoconf"                           # Automatic configure script builder
brew "automake"                           # Tool for generating GNU Standards-compliant Makefiles
brew "bat"                                # Clone of cat(1) with syntax highlighting and Git integration
brew "btop"                               # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "cloc"                               # Statistics utility to count lines of code
brew "colordiff"                          # Color-highlighted diff(1) output
brew "coreutils"                          # GNU File, Shell, and Text utilities
brew "curl"                               # Get a file from an HTTP, HTTPS or FTP server
brew "duf"                                # Disk Usage/Free Utility - a better 'df' alternative
brew "fd"                                 # Simple, fast and user-friendly alternative to find
brew "findutils"                          # Collection of GNU find, xargs, and locate
brew "fx"                                 # Terminal JSON viewer
brew "fzf"                                # Command-line fuzzy finder written in Go
brew "gawk"                               # GNU awk utility
brew "gdu"                                # Disk usage analyzer with console interface written in Go
brew "gnu-indent"                         # C code prettifier
brew "gnu-sed"                            # GNU implementation of the famous stream editor
brew "gnu-tar"                            # GNU version of the tar archiving utility
brew "gnuplot"                            # Command-driven, interactive function plotting
brew "grep"                               # GNU grep, egrep and fgrep
brew "htop"                               # Improved top (interactive process viewer)
brew "jc"                                 # Serializes the output of command-line tools to structured JSON output
brew "jq"                                 # Lightweight and flexible command-line JSON processor
brew "ncdu"                               # NCurses Disk Usage
brew "procs"                              # Modern replacement for ps written in Rust
brew "pstree"                             # Show ps output as a tree
brew "ripgrep"                            # Search tool like grep and The Silver Searcher
brew "tmux"                               # Terminal multiplexer
brew "tree"                               # Display directories as trees (with optional color/HTML output)
brew "util-linux"                         # Collection of Linux utilities
brew "wget"                               # Internet file retriever
brew "xq"                                 # Command-line XML and HTML beautifier and content extractor
brew "yq"                                 # Process YAML, JSON, XML, CSV and properties documents from the CLI

# Terminals & Shell Tools
brew "bash"                               # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion@2"                  # Programmable completion for Bash 4.2+
brew "chezmoi"                            # Manage your dotfiles across multiple diverse machines, securely
brew "zoxide"                             # Shell extension to navigate your filesystem faster
cask "ghostty"                            # Terminal emulator that uses platform-native UI and GPU acceleration

# Fonts
cask "font-jetbrains-mono"

